# Week 6 in class

#### Learning goals
- Introducing you to advanced data cleaning methods
- Introducing you to saving DataFrames
- Increasing your comfort with using `groupby`, `pivot_table`, and reshaping.

In [60]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

## Cleaning Data

For many data projects, a [significant proportion of
time](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#74d447456f63)
is spent collecting and cleaning the data — not performing the analysis.

This non-analysis work is often called “data cleaning”.

pandas provides very powerful data cleaning tools, which we
will demonstrate using the following dataset.

In [2]:
df = pd.DataFrame({"numbers": ["#23", "#24", "#18", "#14", "#12", "#10", "#35"],
                   "nums": ["23", "24", "18", "14", np.nan, "XYZ", "35"],
                   "colors": ["green", "red", "yellow", "orange", "purple", "blue", "pink"]})
df

  numbers nums  colors
0     #23   23   green
1     #24   24     red
2     #18   18  yellow
3     #14   14  orange
4     #12  NaN  purple
5     #10  XYZ    blue
6     #35   35    pink

What would happen if we wanted to try and compute the mean of
`numbers`?

In [3]:
#df["numbers"].mean()

It throws an error!

Can you figure out why? Hint: As always, when looking at error messages, start at the very
bottom.

The final error says, `TypeError: Could not convert #23#24... to numeric`.

---------

**Exercise 1**

Convert the string below into a number.

In [4]:
c2n = "#39"
# YOUR CODE HERE
raise NotImplementedError()

### String Methods

One way to make this change to every element of a column would be to loop through all elements of the column and apply the desired string methods… One significantly faster (and easier) method is to apply a string method to an entire column of data.

Most methods that are available to a Python string are also available to a pandas Series that has `dtype` object. We access them by doing `s.str.method_name` where `method_name` is the name of the method. When we apply the method to a Series `s`, it is applied to all rows in the Series in one shot!

For example, we can check whether the colors contain blue, as below:

In [6]:
df["colors"].str.contains("blue")

0    False
1    False
2    False
3    False
4    False
5     True
6    False
Name: colors, dtype: bool

**Exercise 2**

Make a new column called `numbers_str` that contains the elements of
`numbers` but without `"#"`. Afterwards, show the data types in the DataFrame.

In [7]:
# YOUR CODE HERE
raise NotImplementedError()

### Type Conversions

The `dtype` of the `numbers_str` column shows that pandas still treats it as a string even after we have removed the `"#"`.

We need to convert this column to numbers. The best way to do this is using the `pd.to_numeric` function.

This method attempts to convert whatever is stored in a Series into numeric values. For example, after the `"#"` removed, the numbers of column `"numbers"` are ready to be converted to actual numbers, as below.

In [9]:
df["numbers_numeric"] = pd.to_numeric(df["numbers_str"])
df.dtypes

numbers            object
nums               object
colors             object
numbers_str        object
numbers_numeric     int64
dtype: object

We can convert to other types well. Using the `astype` method, we can convert to any of the supported pandas `dtypes`. For example, we can convert our new variable from integers to floats, as below.

In [10]:
df["numbers_numeric"] = df["numbers_numeric"].astype(float)
df.dtypes

numbers             object
nums                object
colors              object
numbers_str         object
numbers_numeric    float64
dtype: object

**Exercise 3**

Convert the column `"nums"` to a numeric type and save it to the DataFrame as `"nums_tonumeric"`.

*Hint:* Notice that there is a missing value, and a value that is not a number. Look at the documentation for `pd.to_numeric` and think about how to overcome this.

Why could your solution be a bad idea if used without knowing what your data looks like? 

*Hint:* Think about what happens when you apply it to the `"numbers"` column before replacing the `"#"`.

In [11]:
# YOUR CODE HERE
raise NotImplementedError()

YOUR ANSWER HERE

**Exercise 4**

Convert the column `"numbers_numeric"` back into integers.

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()

### Missing data

**Exercise 5**

Looking at the other variables, you notice that the missing item should be 10. Replace the missing item with 10.

In [15]:
# YOUR CODE HERE
raise NotImplementedError()

## Case study

We will now use data from an [article](https://www.nytimes.com/interactive/2015/02/17/upshot/what-do-people-actually-order-at-chipotle.html) written by The Upshot at the NYTimes.

The csv-file `chipotle_raw.csv` has order information from almost 2,000 [Chipotle](https://en.wikipedia.org/wiki/Chipotle_Mexican_Grill) orders and includes information on what was ordered and how much it cost.

In [56]:
chipotle = pd.read_csv("chipotle_raw.csv")
chipotle.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

**Exercise 6**

We'd like you to use this data and all your data cleaning skills to answer the following questions.

- What is the average price of an item with chicken?  
- What is the average price of an item with steak?  
- Did chicken or steak produce more revenue (total)? 

*Hint:* You may need to use the string methods shown above, and don't forget to use the variable `quantity`.

In [20]:
# YOUR CODE HERE
raise NotImplementedError()

## Writing DataFrames

Let’s now talk about saving a DataFrame to a file.

As a general rule of thumb, if we have a DataFrame `df` and we would like to save to save it as a file of type `FOO`, then we would call the method named `df.to_FOO(...)`.

We will show you how this can be done and try to highlight some issues. But, we will not cover all possible options and features — we feel it is best to learn these as you need them by consulting the appropriate documentation.

Let’s show `df.to_csv` as an example.

Without any additional arguments, the `df.to_csv` function will return a string containing the csv form of the DataFrame:

In [23]:
print(chipotle.head().to_csv())

,order_id,quantity,item_name,choice_description,item_price,price_numeric,revenue
0,1,1,Chips and Fresh Tomato Salsa,,$2.39 ,2.39,2.39
1,1,1,Izze,[Clementine],$3.39 ,3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39 ,3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,,$2.39 ,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98 ,16.98,33.96

If we do pass an argument, the first argument will be used as the file name. By default, it ends up in the same folder as your notebook (but you can also specify another path).

In [24]:
chipotle.to_csv("chipotle.csv")

You can see above and in the file that the csv-form contains the index, which will appear as a variable once you read the csv-file again in pandas. You can prevent this with `index = False`, as below.

In [25]:
chipotle.to_csv("chipotle.csv", index = False)

**Exercise 7**

Analogous to above, export the `chipotle` DataFrame as an excel-file `chipotle.xlsx`.

In [26]:
# YOUR CODE HERE
raise NotImplementedError()

## Combining groupby, pivot tables, and reshaping.

Remember the nlsw88 data on a sample of women from this week's homework.

In [55]:
women = pd.read_csv("nlsw88.csv")
women.head()

,idcode,age,race,married,never_married,grade,collgrad,south,smsa,c_city,industry,occupation,union,wage,hours,ttl_exp,tenure
0,1,37,black,single,0,12.0,not college grad,0,SMSA,0,Transport/Comm/Utility,Operatives,union,11.739125,48.0,10.333334,5.333334
1,2,37,black,single,0,12.0,not college grad,0,SMSA,1,Manufacturing,Craftsmen,union,6.400963,40.0,13.621795,5.250000
2,3,42,black,single,1,12.0,not college grad,0,SMSA,1,Manufacturing,Sales,NaN,5.016723,40.0,17.730770,1.250000
3,4,43,white,married,0,17.0,college grad,0,SMSA,0,Professional Services,Other,union,9.033812,42.0,13.211537,1.750000
4,6,42,white,married,0,12.0,not college grad,0,SMSA,0,Manufacturing,Operatives,nonunion,8.083731,48.0,17.820513,17.750000

### Pivot tables

**Exercise 8**

In the homework we used `groupby` to create a bar plot showing average wages of women of different race, see the code below. Now use `pivot_table` instead of `groupby` to create the same bar plot.

In [ ]:
women.groupby("race")["wage"].mean().plot(kind="bar")
# YOUR CODE HERE
raise NotImplementedError()

**Exercise 9**

Use `T` to create a table with each race in a separate column, and rows with average wages, working hours, and education levels (grades)

In [85]:
# YOUR CODE HERE
raise NotImplementedError()

**Exercise 10**

The tabel shows that black women earn lower wages and have a lower education level than white women on average. Can the lower education level  explain why black women earn lower wages? 

Use `pivot_table` to create a two-way table with `race` in the columns, `collgrad` in the rows, and average wages as values.

In [119]:
women.pivot_table(values="wage", index="collgrad", columns="race")

race                  black      other      white
collgrad
college grad      11.358608  11.596778  10.298948
not college grad   5.875918   6.938195   7.318251

We see that the evidence is mixed. Black women with a college degree earn more than white women with a college degree, but black women without a college degree earn less than white women without a college degree. 

### Groupby objects

You conclude that it may be useful to condition on both race and education level. One way to do so is to use a groupby object, like below:

In [96]:
gbCollegeRace = women.groupby(["collgrad", "race"])
type(gbCollegeRace)

pandas.core.groupby.generic.DataFrameGroupBy

You can select those observations that satisfy the group characteristics that you are interested using `get_group`. For instance, the code below shows the first five lines of the DataFrame of all black women without a college degree.

In [102]:
gbCollegeRace.get_group(("not college grad","black")).head() # note a tuple!

,idcode,age,race,married,never_married,grade,collgrad,south,smsa,c_city,industry,occupation,union,wage,hours,ttl_exp,tenure
0,1,37,black,single,0,12.0,not college grad,0,SMSA,0,Transport/Comm/Utility,Operatives,union,11.739125,48.0,10.333334,5.333334
1,2,37,black,single,0,12.0,not college grad,0,SMSA,1,Manufacturing,Craftsmen,union,6.400963,40.0,13.621795,5.250000
2,3,42,black,single,1,12.0,not college grad,0,SMSA,1,Manufacturing,Sales,NaN,5.016723,40.0,17.730770,1.250000
39,75,39,black,single,0,11.0,not college grad,0,nonSMSA,0,Manufacturing,Operatives,union,12.500001,40.0,14.499999,9.333333
47,106,38,black,single,0,12.0,not college grad,1,SMSA,1,Public Administration,Sales,nonunion,10.837358,40.0,17.416666,17.416666

One can directly apply methods to a groupby object. For instance, using `gbCollegeRace` one can compute the mean for each variable splitting observations by both college graduation and race.

In [118]:
gbCollegeRace.mean()

                             idcode        age  never_married      grade  \
collgrad         race
college grad     black  3010.427184  38.378641       0.174757  16.679612
                 other  4023.888889  39.777778       0.222222  16.444444
                 white  2297.002381  39.278571       0.145238  16.735714
not college grad black  3191.666667  38.904167       0.181250  11.549061
                 other  3688.470588  39.058824       0.058824  11.588235
                 white  2434.090386  39.270337       0.053410  12.146382

                           south    c_city       wage      hours    ttl_exp  \
collgrad         race
college grad     black  0.631068  0.611650  11.358608  39.728155  13.840055
                 other  0.000000  0.333333  11.596778  41.111111  13.238604
                 white  0.364286  0.280952  10.298948  38.556086  13.351221
not college grad black  0.641667  0.464583   5.875918  37.774059  12.478045
                 other  0.176471  0.235294   6.938195  34.529412  12.259804
                 white  0.339359  0.200493   7.318251  36.334704  12.163922

                          tenure
collgrad         race
college grad     black  8.066993
                 other  4.500000
                 white  6.582538
not college grad black  6.166141
                 other  5.186274
                 white  5.539666

Note that `collgrad` and `race` appear as (hierarchical) indices.

**Exercise 11**

Use one of the reshaping methods studied last week (`set_index`, `reset_index`, `stack`, or `unstack`) and the groupby object `gbCollegeRace` to create the same two-way table as you made for the previous Exercise.

In [ ]:
# YOUR CODE HERE
raise NotImplementedError()